Tekla Open API Reference for Tekla Structures 2025
ShapeItem.GeometryHash Property
 This obsolete property can still be used to store and externally provided unique hash value identifying the shape. However, Tekla Structures does not use this value internally for anything. It is strongly recommended to use the newer Fingerprint property for future implementations. That value is automatically calculated by Tekla Structures for all inserted shapes and is used internally for shape identification.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GeometryHash { get; }
Public ReadOnly Property GeometryHash As String
	Get
Property Value
Type: String
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace